In [2]:
import pandas as pd
import numpy as np

In [3]:
datas = pd.date_range(start='20190101',periods=12)

In [4]:
datas

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07', '2019-01-08',
               '2019-01-09', '2019-01-10', '2019-01-11', '2019-01-12'],
              dtype='datetime64[ns]', freq='D')

In [5]:
Pessoa = ['George','Victor','Lucas']

In [6]:
#choice = escolha
np.random.choice(Pessoa)

'Lucas'

In [9]:
Nome =[]
Gasto =[]
for i in range(12):
    Nome.append(np.random.choice(Pessoa))
    Gasto.append(np.round(np.random.rand()*100,2))
Nome

['Victor',
 'George',
 'Victor',
 'Lucas',
 'Victor',
 'Victor',
 'Victor',
 'Lucas',
 'George',
 'Victor',
 'Lucas',
 'Victor']

In [10]:
Gasto

[36.74,
 15.44,
 52.48,
 90.96,
 4.48,
 18.94,
 84.4,
 31.26,
 35.95,
 77.56,
 34.29,
 41.09]

In [13]:
df = pd.DataFrame({'Dia': datas,'Nome':Nome,'Gasto':Gasto})

In [14]:
df

          Dia    Nome  Gasto
0  2019-01-01  Victor  36.74
1  2019-01-02  George  15.44
2  2019-01-03  Victor  52.48
3  2019-01-04   Lucas  90.96
4  2019-01-05  Victor   4.48
5  2019-01-06  Victor  18.94
6  2019-01-07  Victor  84.40
7  2019-01-08   Lucas  31.26
8  2019-01-09  George  35.95
9  2019-01-10  Victor  77.56
10 2019-01-11   Lucas  34.29
11 2019-01-12  Victor  41.09

# Ordena com pivot

In [17]:
df.pivot(index="Dia",columns="Nome",values="Gasto")

Nome        George  Lucas  Victor
Dia
2019-01-01     NaN    NaN   36.74
2019-01-02   15.44    NaN     NaN
2019-01-03     NaN    NaN   52.48
2019-01-04     NaN  90.96     NaN
2019-01-05     NaN    NaN    4.48
2019-01-06     NaN    NaN   18.94
2019-01-07     NaN    NaN   84.40
2019-01-08     NaN  31.26     NaN
2019-01-09   35.95    NaN     NaN
2019-01-10     NaN    NaN   77.56
2019-01-11     NaN  34.29     NaN
2019-01-12     NaN    NaN   41.09